Documents/PriceList.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>PriceList</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultPriceList</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Prices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SKU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SKU</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Prices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>Prices</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>PriceList</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PriceList</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SKU</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/PriceList/Forms/DocumentForm/Ext/Form/Module.bsl
#Region CommonProcedureAndFunctions

&AtServer
 Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FillPrices();
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	FillPrices();
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	CurrentObject.AdditionalProperties.Insert("Prices", ThisForm.Prices.Unload());
	
EndProcedure

&AtServer
Procedure FillPrices()
	
	Query = New Query(
	"SELECT ALLOWED
	|	Prices.SKU,
	|	Prices.Price
	|FROM
	|	InformationRegister.Prices AS Prices
	|WHERE
	|	Prices.PriceList = &PriceList");
	Query.SetParameter("PriceList", ThisForm.Object.Ref);
	Result = Query.Execute().Unload();
	
	ThisForm.Prices.Load(Result);
	
EndProcedure

&AtServer
Procedure FillSKUServer()
	
	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED
		|	SKU.Ref
		|FROM
		|	Catalog.SKU AS SKU
		|WHERE
		|	NOT SKU.Ref IN (&SKUArray)";
		
	Query.SetParameter("SKUArray", ThisForm.Prices.Unload(, "SKU"));
	
	Result = Query.Execute().Unload();
	
	For Each Value In Result Do
		
		NewRow = ThisForm.Prices.Add();
		NewRow.SKU = Value.Ref;
		
	EndDo;
	
EndProcedure

&AtServer
Procedure OnOpenAtServer()
	
	Items.Number.ReadOnly = Not Users.HaveAdditionalRight(Catalogs.AdditionalAccessRights.EditDocumentNumbers);

EndProcedure

#EndRegion

#Region UserInterface

&AtClient
Procedure FillSKU(Command)
    
    FillSKUServer();

EndProcedure

&AtClient
Procedure SKUSKUOnChange(Item)
   
    requestMap = New Map;
    requestMap.Insert("pName", "SKU");
    requestMap.Insert("checkingItem", Items.SKU.CurrentData);
    requestMap.Insert("tabularSection", Object.Prices);
    
    ClientProcessors.UniqueRows(requestMap); 
    
EndProcedure

&AtClient
Procedure DeleteSKU(Command)
	
	CurrentData = ThisForm.Items.Prices.CurrentData;
	
	If Not CurrentData = Undefined Then
		
		ThisForm.Prices.Delete(ThisForm.Prices.IndexOf(CurrentData));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	OnOpenAtServer();
EndProcedure

#EndRegion
